insert into book values
(1, 'Преступление и наказание', '978-5-17-090630-7', 2, 0),
(2, 'Собачье сердце', '978-5-17-115274-1', 5, 4),
(3, 'Братья Карамазовы', '978-5-17-139129-4', 3, 3),
(4, 'Алгебра. Наглядный школьный курс', '978-985-579-596-5', 10, 9);

insert into author values
(1, 'Федор', 'Достоевский'),
(2, 'Михаил', 'Булгаков'),
(3, 'Татьяна', 'Степанова'),
(4, 'Ольга', 'Аксенова');

insert into authorbook values
(1, 1),
(2, 2),
(1, 3),
(3, 4),
(4, 4);

insert into reader values
(1, 'Иван', 'Иванов', '79999999999'),
(2, 'Татьяна', 'Петрова', '79876543210');

insert into loan values
(1, 1, 1, '1900-03-01', '1900-03-15', 2),
(2, 1, 2, '2026-03-03', '2026-03-17', 3),
(3, 4, 2, '2026-03-22', '2026-04-05', 2),
(4, 2, 1, '2026-03-22', null, 1)
